In [2]:
import pandas as pd

In [1]:
data = [
    ["John", 98556556846],
    ["Harsh", 64524248226],
    ["Heet", 89824565135],
    ["Dhruvi", 48486318987]
]

In [5]:
df = pd.DataFrame(data, columns=["Name", "Phone Number"])

In [6]:
df

     Name  Phone Number
0    John   98556556846
1   Harsh   64524248226
2    Heet   89824565135
3  Dhruvi   48486318987

In [7]:
df["Age"] = [45,32,12,87]

In [8]:
df

     Name  Phone Number  Age
0    John   98556556846   45
1   Harsh   64524248226   32
2    Heet   89824565135   12
3  Dhruvi   48486318987   87

In [15]:
df.insert(3, "Marks", [98,87,95,89])

In [16]:
df

     Name  Phone Number  Age  Marks
0    John   98556556846   45     98
1   Harsh   64524248226   32     87
2    Heet   89824565135   12     95
3  Dhruvi   48486318987   87     89

In [17]:
df.drop("Marks", axis=1)

     Name  Phone Number  Age
0    John   98556556846   45
1   Harsh   64524248226   32
2    Heet   89824565135   12
3  Dhruvi   48486318987   87

In [18]:
df.drop("Marks", axis=1, inplace=True)

In [19]:
df

     Name  Phone Number  Age
0    John   98556556846   45
1   Harsh   64524248226   32
2    Heet   89824565135   12
3  Dhruvi   48486318987   87